title: Windows Failed Logon Attempt Test 4625 QRadar
id: 11111111-2222-3333-4444-555555555555
status: experimental
logsource:
    product: windows
    service: security
detection:
    failed_logon:
        EventID: 4625
    condition: failed_logon
level: medium
