title: Windows Event Log Cleared
id: 22222222-3333-4444-5555-666666666666
status: experimental
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 1102
    condition: selection
level: high
