title: Windows - Failed Logon Attempt
id: 11111111-2222-3333-4444-555555555555
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4625
  condition: selection
level: medium
