title: Windows - Successful RDP Logon
id: 20000000-0002
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 10
  condition: selection
level: medium
