title: Windows - Suspicious PowerShell Execution
id: 20000000-0009
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\powershell.exe'
  keywords:
    CommandLine|contains:
      - 'EncodedCommand'
      - 'DownloadString'
      - 'IEX'
      - 'Invoke-WebRequest'
  condition: selection and keywords
level: high
